charliejgallo/ESP32S3_AmoledOS/sdkconfig.defaults
# --- microSD: nombres de archivo largos --------------------------------------
# Por defecto FATFS viene en 8.3, y con eso "hello_app.so" (9 caracteres antes
# del punto) directamente no se ve, ni una foto con nombre normal. El buffer de
# nombre largo va al heap, que con SPIRAM_USE_MALLOC cae en PSRAM.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_CODEPAGE_850=y

# --- Recuperar IRAM para el codigo de las apps -------------------------------
# LVGL necesita su IRAM para dibujar rapido, asi que la sacamos de otro lado.
# El wifi ubica parte de su pila en IRAM para exprimir el rendimiento de radio;
# en un reloj que solo la usa para el portal web, eso es IRAM regalada.
# FreeRTOS tambien puede vivir en flash: cuesta unos ciclos por llamada.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y

# Los buferes de CAPA salen del heap de LVGL. Con el pool propio de 64 KB, una
# capa que no entra hace que lv_draw_layer_alloc_buf devuelva NULL, dispatch
# conteste LV_DRAW_UNIT_IDLE y LVGL REINTENTE PARA SIEMPRE: 100% de CPU,
# watchdog cada 5 s y pantalla congelada. No aborta nunca. Pasando LVGL al
# malloc del sistema el techo pasa a ser la PSRAM (6,4 MB) en vez de 64 KB.
# Con SPIRAM_MALLOC_ALWAYSINTERNAL=4096 lo chico sigue cayendo en RAM interna
# (rapida) y solo los buferes grandes van a PSRAM.
CONFIG_LV_USE_CLIB_MALLOC=y

# Pendiente: CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2 repartiria el dibujo entre los dos
# nucleos, pero exige LV_USE_OS, que agrega un campo a lv_global_t. Eso cambia el
# layout compartido con las apps dinamicas: habria que recompilarlas TODAS y
# volver a copiarlas a la SD, y ademas puede chocar con el mutex de esp_lvgl_port.

# La cache de imagenes venia APAGADA (LV_CACHE_DEF_SIZE=0 y header cache en 0),
# asi que cada dibujo de un canvas reabria el decodificador y recorria todos los
# decodificadores registrados. Es el mismo camino que aparecio en el backtrace
# del cuelgue (lv_image_decoder_open -> decoder_info de tjpgd). Claudito y 2043
# redibujan un canvas a pantalla completa cada cuadro, o sea que lo pagaban 7
# veces por segundo... y por eso iban a 7 fps.
# Verificado en lv_global.h: img_cache e img_header_cache son punteros sin #if,
# asi que esto NO cambia el layout y NO obliga a recompilar las apps.
# OJO: esto NO es solo una cache de rendimiento. Si una imagen decodificada no
# entra, lv_lodepng.c la DESTRUYE y devuelve LV_RESULT_INVALID: la foto no se ve.
# Y con 0 es peor todavia, porque lv_cache_add() devuelve NULL de entrada.
# Una foto a pantalla completa decodificada son 368*448*2 = 330 KB, asi que el
# presupuesto tiene que dar para varias. Es un presupuesto, no una reserva: la
# memoria sale de lv_malloc cuando hace falta, y con este tamano va a PSRAM.
CONFIG_LV_CACHE_DEF_SIZE=4194304
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=32

# El watchdog venia en modo "solo avisar": ante un cuelgue imprimia cada 5 s y
# la placa quedaba muerta hasta cortarle la alimentacion con el boton 10 s.
# Con PANIC reinicia sola y vuelve en unos segundos. No tapa el bug de fondo,
# pero un reloj que se reinicia es muchisimo mejor que uno que hay que resucitar.
CONFIG_ESP_TASK_WDT_PANIC=y

# --- Memoria de WiFi ---------------------------------------------------------
# El .text de las apps dinamicas sale de RAM interna (MALLOC_CAP_EXEC), la misma
# de la que come la pila de WiFi. Con la red levantada, la memoria ejecutable
# caia de 184 KB a 93 KB y las apps grandes (2043, gemas) ya no entraban.
# Los buffers de transmision dinamicos no se pueden usar: el choice de ESP-IDF
# los deshabilita cuando esta SPIRAM_TRY_ALLOCATE_WIFI_LWIP. Se bajan cantidades.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=8
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16

# Mueve el .bss de lwip, net80211, pp y wpa_supplicant a PSRAM. No son reservas
# de malloc (para eso ya esta SPIRAM_TRY_ALLOCATE_WIFI_LWIP) sino variables
# globales que se ubican AL ENLAZAR: cada componente trae el esquema
# 'extram_bss' en su linker.lf y esta opcion lo activa.
#
# Ojo: una variable en PSRAM no se puede tocar con la cache deshabilitada
# (escrituras a flash). ESP-IDF lo contempla para estas bibliotecas, pero es el
# mismo motivo por el que NO movemos pilas de tareas.
#
# No arregla fragmentacion; sube el total. Se activa DESPUES de resolver la
# fragmentacion con la reserva de codigo, para que la mejora sea atribuible.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# --- TLS ---------------------------------------------------------------------
# Los cuatro ajustes salen de medir en la placa, no de suponer: los numeros
# estan en docs/HANDOFF-HAL-RED-MIC.md seccion 3.1. Ninguno es un CONFIG_LV_*,
# asi que NO obligan a recompilar las apps de la microSD; solo a reflashear.
#
# El decisivo. Sin el, un handshake se lleva 34,6 KB de RAM INTERNA sostenidos
# y 42,5 de pico, y —medido con MALLOC_CAP_EXEC aparte— sale del MISMO pool del
# que se reserva el .text de los .so: con un tunel abierto quedaban 12,6 KB
# ejecutables de 47,3, o sea que la reserva de 48 KB de las apps desaparecia
# mientras hubiera una consulta. Peor: dos peticiones a la vez hundian la
# interna a 22 KB, por debajo de los ~26 KB donde el incidente de la esfera de
# palabras midio que empiezan a fallar los buffers de DMA del volcado.
# Con esto prendido: 3,5 KB internos, y dos a la vez dejan 93 KB libres sin
# fragmentar el bloque grande. Por eso HTTP_SLOTS puede quedarse en 3.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Ya no decide nada —con lo de arriba todo vive en PSRAM, que sobra— pero baja
# el consumo de PSRAM por conexion de 31,6 KB a 10,3 por 3 KB de flash.
# OJO: MBEDTLS_DYNAMIC_FREE_PEER_CERT NO EXISTE en IDF 5.5 y Kconfig lo ignora
# en silencio. Se llama MBEDTLS_DYNAMIC_FREE_CA_CERT y lo selecciona este solo.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

# El bundle CMN son 48 KB menos de flash que el FULL de 200 certificados, y
# medido valida los mismos servidores (api.open-meteo.com, www.howsmyssl.com).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

